#include "HeaderTitle.h"

int HeaderTitle()
{
    setlocale(LC_ALL, "Russian");

        cout << "Урок 1. Переменные и ввод с клавиатуры." << endl;
        cout << "Задание 1 - Перевод из Цельсия в Фаренгейт" << endl;
        cout << "Задание 2. Конвертер валют на 09.12.2022 \n" << endl;

        cout << "Урок 2. Типы данных." << endl;
        cout << "Задание 1. Перевод секунд в дни,часы, минуты \n" << endl;

        cout << "Урок 3. if-else-switch." << endl;
        cout << "Задание 1. Найти корни квадратного уравнения" << endl;
        cout << "Задание 2. Калькулятор \n" << endl;
    
        cout << "Урок 4. Циклы." << endl;
        cout << "Задание 1. Возводить двойку в степень до какого-то числа" << endl;
        cout << "Задание 2. Потренить с -do/while" << endl;
        cout << "Задание 3. Может сделаю может нет - найти наибольший общий делитель и наименьшее кратное. \nЕще можно сделать ту фигню что вова говорил с пифагором \n" << endl;

        cout << "Урок 5. Массивы." << endl;
        cout << "Задание 1. Простые числа \n" << endl;
        cout << "Задание 2. Поиск мин/макс чисел массива\n" << endl;
        cout << "Задание 3. Сортировка чисел массива \n" << endl;

        cout << "------------------------------------------------------------------------------------------------------" << endl;

        cout << "Урок 6. Строки и двумерные массивы. " << endl;
        cout << "Задание 1. Вычисление количества слов в предложении  \n" << endl;

        cout << "Урок 7. Игра - Крестики-нолики. \n" << endl;

        cout << "Урок 8. Аргументы функций." << endl;
        cout << "Задание 1. Передача значений из аргументов другой функции.  \n" << endl;

        cout << "Урок 9. Структуры данных." << endl;
        cout << "Задание 1. Ввод сотрудников. Если много пропусков - сотрудник уволен.  \n" << endl;

        cout << "Урок 10. Односвязный список." << endl;
        
        cout << "------------------------------------------------------------------------------------------------------" << endl;

        cout << "Введите номер урока для получения соответствующего задания \n" << endl;

        return 0;
}
